AlexeyStarovoitov/STM32F103C8T6/STM32F103 ENC28J60 MQTT TCP/User/Sources/net.c
#include "stm32f10x.h"
#include "gpio.h"
#include "enc28j60.h"
#include "spi.h"
#include "uart.h"
#include "net.h"
#include <stdlib.h>
#include <string.h>
#include <stdio.h>

/*
extern uint8_t mac_addr[6];
extern uint8_t mac_addr_null[6];
extern uint8_t mac_addr_bc[6];
extern uint8_t ip_addr[4];
extern uint8_t ip_dst[4];

extern enc28_frame frame;
extern uint32_t clk_s; 

uint16_t dst_prt;
arp_record arp_table[ARP_TABLE_LEN];
uint8_t cur_index;
uart_ip ip_dst_str;
*/

void net_init(net_socket * socket)
{
	uint16_t i ;
	socket->frame_req.data = socket->frame_repl.data = NULL;
	socket->frame_req.data_len = socket->frame_repl.data_len = 0;
	
	memecpy(socket->mac_addr_src, MAC_ADDR_SRC, sizeof(MAC_ADDR_SRC));
	memset(socket->mac_addr_dst, 0, sizeof(*socket->mac_addr_dst));
	memecpy(socket->ip_addr_src, IP_ADDR_SRC, sizeof(IP_ADDR_SRC));
	memset(socket->ip_addr_dst, 0, sizeof(*socket->ip_addr_dst));
	
	socket->udp_src_prt = socket->udp_dst_prt = 0;
	socket->tcp_src_prt = socket->tcp_dst_prt = 0;
	socket->tcp_seq_num = socket->tcp_ack_num = 0;
	
	socket->ip_dst_str.buf_len = 0;
	socket->ip_dst_str.ip_rec = 0;
	
	socket->cur_index = 0;
	socket->clk_s = 0;
	memset(socket->arp_table, 0, sizeof(*socket->arp_table));
	
	uart_transmit((uint8_t *)"Start\r\n", 7);
}

void ip_str2num(char *ip_str, uint8_t *ip_num)
{
	uint8_t i, prt_len;
	char prt_str[5];
	char *dot_ptr, *sc_ptr;
	
	for(i = 0; i < 3; i++)
	{
		dot_ptr = strchr(ip_str, '.');
		
		prt_len = dot_ptr - ip_str+1;
		strncpy(prt_str, ip_str, prt_len);
		prt_str[prt_len] = 0;
		ip_num[i] = atoi(prt_str);
		ip_str = dot_ptr+1;
		
	}
	
	sc_ptr = strchr(ip_str, ':');
	if(sc_ptr)
	{
		prt_len = sc_ptr - ip_str+1;
		strncpy(prt_str, ip_str, prt_len);
		prt_str[prt_len] = 0;
		ip_num[i] = atoi(prt_str);
	}
	else
		ip_num[i] = atoi(ip_str);
	

}


uint16_t port_str2num(char *ip_str)
{
	uint16_t port;
	char *dot_ptr;
	
	dot_ptr = strchr(ip_str, ':');
	port = atoi(dot_ptr + 1);

	return port;
}

uint16_t ip_ch_sum_calc(uint8_t *head, uint16_t len, uint8_t type)
{
	
	uint32_t sum = 0;
	
	if(type == UDP_CH_SUM)
	{
		sum += IP_UDP;
		sum += len - 8;
	}
	else if(type == TCP_CH_SUM)
	{
		sum += IP_TCP;
		sum += len - 8;
	}
	
	while(len > 1)
	{
		sum += (uint16_t)(((uint16_t)*head << 8) | ((uint16_t)*(head+1)));
		len -=2;
		head += 2;
	}
	
	if(len)
		sum += (uint16_t)(((uint16_t)*head << 8) | ((uint16_t)0x00));
	
	while(sum & 0xFFFF0000)
		sum = ((sum >> 16) & 0x0000FFFF) + (sum & 0x0000FFFF);
	
	return ~be16toword(sum);
}

void eth_reply(net_socket * socket, uint16_t dat_len)
//void eth_reply(enc28_frame *frame_repl, uint16_t dat_len)
{
	memcpy(socket->frame_repl.hdr.dest_addr,   socket->mac_addr_dst, sizeof(*socket->mac_addr_dst));
	memcpy(socket->frame_repl.hdr.src_addr, socket->mac_addr_src, sizeof(*socket->mac_addr_src));
	
	socket->frame_repl.data_len = dat_len; 
	enc28_packet_transmit(socket->frame_repl);
}

void eth_request(net_socket * socket, uint16_t prot_type, uint16_t dat_len)
//void eth_request(enc28_frame *frame_req, uint16_t prot_type, uint8_t *mac_dest, uint16_t dat_len)
{
	
	memcpy(socket->frame_req.hdr.dest_addr,   socket->mac_addr_dst, sizeof(*socket->mac_addr_dst));
	memcpy(socket->frame_req.hdr.src_addr, socket->mac_addr_src, sizeof(*socket->mac_addr_src));

	socket->frame_req.hdr.type = prot_type;
	socket->frame_req.data_len = dat_len; 
	enc28_packet_transmit(socket->frame_req);
}


//void arp_reply(enc28_frame *frame_rec,  uint16_t arp_pckt_len)
void arp_reply(net_socket * socket,  uint16_t arp_pckt_len)
{
	arp_pckt *arp_repl = (void*)socket->frame_rec.data;
	
	
	memcpy(socket->mac_addr_dst, arp_repl->mac_src, sizeof(arp_repl->mac_src));
	memcpy(socket->mac_addr_src, MAC_ADDR_SRC, sizeof(MAC_ADDR_SRC));
	memcpy(socket->ip_addr_dst, arp_repl->ip_src, sizeof(arp_repl->ip_src));
	memcpy(socket->ip_addr_src, IP_ADDR_SRC, sizeof(IP_ADDR_SRC));
	
	
	arp_repl->req_type = ARP_REP;
	memcpy(arp_repl->mac_dest, socket->mac_addr_dst, sizeof(socket->mac_addr_dst));
	memcpy(arp_repl->mac_src, socket->mac_addr_src, sizeof(socket->mac_addr_src));
	memcpy(arp_repl->ip_dest, socket->ip_addr_dst, sizeof(socket->ip_addr_dst));
	memcpy(arp_repl->ip_src, socket->ip_addr_src, sizeof(socket->ip_addr_src));
	
	eth_reply(socket, sizeof(arp_pckt));
	
}

uint8_t arp_request (net_socket * socket, uint8_t *ip_dst)
{
	//enc28_frame frame_req;
	socket->frame_req.data = (uint8_t*) calloc(sizeof(arp_pckt), sizeof(*socket->frame_req.data));
	arp_pckt *arp_req = (void *)socket->frame_req.data;
	
	memcpy(socket->mac_addr_dst, MAC_ADDR_BC, sizeof(MAC_ADDR_BC));
	memcpy(socket->mac_addr_src, MAC_ADDR_SRC, sizeof(MAC_ADDR_SRC));
	memcpy(socket->ip_addr_dst, ip_dst, sizeof(ip_dst));
	memcpy(socket->ip_addr_src, IP_ADDR_SRC, sizeof(IP_ADDR_SRC));
	
	arp_req->net_type = ARP_ETH;
	arp_req->prot_type = ARP_IP;
	arp_req->mac_len = sizeof(socket->mac_addr_src);
	arp_req->ip_len = sizeof(socket->ip_addr_src);
	arp_req->req_type = ARP_REQ;
	memcpy(arp_req->mac_dest, MAC_ADDR_NULL, sizeof(MAC_ADDR_NULL));
	memcpy(arp_req->mac_src, socket->mac_addr_src, sizeof(socket->mac_addr_src));
	memcpy(arp_req->ip_dest, socket->ip_addr_dst, sizeof(socket->ip_addr_dst));
	memcpy(arp_req->ip_src, socket->ip_addr_src, sizeof(socket->ip_addr_src));

	
	eth_request(socket, ARP_TYPE, sizeof(arp_pckt));
	free(socket->frame_req.data);
	
	return 1;
}


void fill_arp_table(arp_record *arp_tbl_ptr, uint8_t *cur_len, uint8_t arp_tbl_len, uint32_t clk, enc28_frame *frame_rec)
{
	uint8_t i;
	arp_pckt *arp_repl = (arp_pckt *)frame_rec->data;
	
	if (*cur_len >= arp_tbl_len)
		*cur_len = arp_tbl_len - 1;
	for(i = 0; i < *cur_len; i++)
		if(!memcmp(arp_tbl_ptr[i].ip_addr, arp_repl->ip_src, 4))
			break;
	if(i == *cur_len)
	{		
		memcpy(arp_tbl_ptr[*cur_len].mac_addr, arp_repl->mac_src, 6);
		memcpy(arp_tbl_ptr[*cur_len].ip_addr, arp_repl->ip_src, 4);
		arp_tbl_ptr[*cur_len].clk = clk;
		(*cur_len)++;
	}
	for(i = 0; i < *cur_len; i++)
	{
		if((clk_s - arp_tbl_ptr[i].clk) > CLK_TIM_OUT)
			dlt_arp_table_record(arp_tbl_ptr, i, cur_len);
		
