AlexeyStarovoitov/STM32F103C8T6/STM32F103 ENC28J60 MQTT TCP/User/Sources/net.c
	}
}

int8_t find_arp_table_data(arp_record *arp_tbl_ptr, uint8_t cur_len, uint8_t *ip_num)
{
	int8_t i;
	
	for(i = 0; i < cur_len; i++)
		if(!memcmp(arp_tbl_ptr->ip_addr, ip_num, 4))
			break;
		
	if(i == cur_len)
		i = -1;
	
	return i;
	
}

void show_arp_table(arp_record *arp_tbl_ptr, uint8_t cur_len)
{
	uint8_t i;
	char s1[STR_LEN];
	
	uart_transmit((uint8_t *)"\r\n", 2);
	sprintf(s1,"ARP Table\r\n");
	uart_transmit((uint8_t *)s1, strlen(s1));
	
	for(i = 0; i < cur_len; i++)
	{
		sprintf(s1,"%d: mac_address: %02X:%02X:%02X:%02X:%02X:%02X - source_address: %d:%d:%d:%d, time: %d\r\n", i+1, arp_tbl_ptr[i].mac_addr[0],\
		arp_tbl_ptr[i].mac_addr[1], arp_tbl_ptr[i].mac_addr[2], arp_tbl_ptr[i].mac_addr[3], arp_tbl_ptr[i].mac_addr[4], arp_tbl_ptr[i].mac_addr[5],\
		arp_tbl_ptr[i].ip_addr[0], arp_tbl_ptr[i].ip_addr[1], arp_tbl_ptr[i].ip_addr[2], arp_tbl_ptr[i].ip_addr[3], arp_tbl_ptr[i].clk);
		uart_transmit((uint8_t *)s1, strlen(s1));
				
	}
}

void dlt_arp_table_record(arp_record *arp_tbl_ptr, uint8_t dlt_index, uint8_t *cur_len)
{
	uint8_t i;
	
	for(i = dlt_index; i <  (*cur_len - 1); i++)
		arp_tbl_ptr[i] = arp_tbl_ptr[i+1];
	
	(*cur_len)--;
	
}


//uint8_t arp_read(enc28_frame *frame_rec, uint16_t len)
uint8_t arp_read(net_socket * socket, uint16_t len)
{
	uint8_t res = 0;
	char s1[STR_LEN];
	
	arp_pckt *arp_mess = (void *)(socket->frame_rec.data);
	if(((arp_mess->net_type) == ARP_ETH) && (arp_mess->prot_type == ARP_IP) && (len >= sizeof(arp_pckt))&& (!memcmp(arp_mess->ip_dest, IP_ADDR_SRC, 4)))
	{
		if((arp_mess->req_type) == ARP_REQ)
		{

			sprintf(s1,"ARP request\r\n");
			uart_transmit((uint8_t *)s1, strlen(s1));
			res = 1;
			
		}
		else if ((arp_mess->req_type) == ARP_REP)
		{
			sprintf(s1,"ARP reply\r\n");
			uart_transmit((uint8_t *)s1, strlen(s1));
			res = 2;
			
		}
		
		sprintf(s1,"mac_source %02X:%02X:%02X:%02X:%02X:%02X\r\n", arp_mess->mac_src[0],\
		arp_mess->mac_src[1], arp_mess->mac_src[2], arp_mess->mac_src[3], arp_mess->mac_src[4], arp_mess->mac_src[5]);
		uart_transmit((uint8_t *)s1, strlen(s1));
			
		sprintf(s1,"ip_source %03d.%03d.%03d.%03d\r\n", arp_mess->ip_src[0],\
		arp_mess->ip_src[1], arp_mess->ip_src[2], arp_mess->ip_src[3]);
		uart_transmit((uint8_t *)s1, strlen(s1));
			
		sprintf(s1,"mac_dest %02X:%02X:%02X:%02X:%02X:%02X\r\n", arp_mess->mac_dest[0],\
		arp_mess->mac_dest[1], arp_mess->mac_dest[2], arp_mess->mac_dest[3], arp_mess->mac_dest[4], arp_mess->mac_dest[5]);
		uart_transmit((uint8_t *)s1, strlen(s1));
			
		sprintf(s1,"ip_dest %03d.%03d.%03d.%03d\r\n", arp_mess->ip_dest[0],\
		arp_mess->ip_dest[1], arp_mess->ip_dest[2], arp_mess->ip_dest[3]);
		uart_transmit((uint8_t *)s1, strlen(s1));
		
	}
		return res;
}


//uint8_t ip_reply(enc28_frame *frame_repl, uint16_t ip_dat_len)
uint8_t ip_reply(net_socket * socket, uint16_t ip_dat_len)
{
	ip_pckt ip_msg; 
	uint8_t res = 0;
	
	ip_msg.hdr = (void *)socket->frame_repl.data;
	ip_msg.data_len = ip_dat_len;
	
	memcpy(socket->mac_addr_dst, socket->frame_repl.hdr.src_addr, sizeof(socket->frame_repl.hdr.src_addr));
	memcpy(socket->mac_addr_src, MAC_ADDR_SRC, sizeof(MAC_ADDR_SRC));
	memcpy(socket->ip_addr_dst, ip_msg.hdr->ip_src, sizeof(socket->ip_addr_dst));
	memcpy(socket->ip_addr_src, IP_ADDR_SRC, sizeof(IP_ADDR_SRC));
	
	
	ip_msg.hdr->flgs_fr_off = 0;
	ip_msg.hdr->ttl = 128;
	memcpy(ip_msg.hdr->ip_dest, socket->ip_addr_dst,sizeof(socket->ip_addr_dst));
	memcpy(ip_msg.hdr->ip_src, socket->ip_addr_src,sizeof(socket->ip_addr_src));
	ip_msg.hdr->pack_len =  be16toword(ip_msg.data_len + sizeof(ip_header));
	
	ip_msg.hdr->ch_sum = 0;
	ip_msg.hdr->ch_sum = ip_ch_sum_calc((void *)ip_msg.hdr, sizeof(ip_header), 0);
	
	
	eth_reply(frame_repl, ip_msg.data_len + sizeof(ip_header));
	
	return res;
}

//void ip_request(enc28_frame *frame_req, uint8_t prot, uint8_t *mac_dest, uint8_t *ip_dest, uint16_t dat_len)
void ip_request(net_socket * socket, uint8_t prot, uint8_t *mac_dest, uint8_t *ip_dest, uint16_t dat_len)
{
	ip_pckt ip_req;
	
	ip_req.data_len = dat_len;
	ip_req.data = socket->frame_req.data + sizeof(ip_header);
	ip_req.hdr = (void*)(socket->frame_req.data);
	
	memcpy(socket->mac_addr_dst, mac_dest, sizeof(socket->mac_addr_dst));
	memcpy(socket->mac_addr_src, MAC_ADDR_SRC, sizeof(MAC_ADDR_SRC));
	memcpy(socket->ip_addr_dst, ip_dest, sizeof(socket->ip_addr_dst));
	memcpy(socket->ip_addr_src, IP_ADDR_SRC, sizeof(IP_ADDR_SRC));
	
	ip_req.hdr->ver_hlen = IP_VERLEN;
	ip_req.hdr->tos = 0;
	ip_req.hdr->pack_len =  be16toword(ip_req.data_len + sizeof(ip_header));
	ip_req.hdr->id = 0;
	ip_req.hdr->flgs_fr_off = 0;
	ip_req.hdr->ttl = 128;
	ip_req.hdr->prot_id = prot;
	memcpy(ip_req.hdr->ip_dest, socket->ip_addr_dst, sizeof(socket->ip_addr_dst));
	memcpy(ip_req.hdr->ip_src, socket->ip_addr_src, sizeof(socket->ip_addr_src));
	
	ip_req.hdr->ch_sum = 0;
	ip_req.hdr->ch_sum = ip_ch_sum_calc((uint8_t *)ip_req.hdr, sizeof(ip_header), 0);
	
	eth_request(socket, IP_TYPE, ip_req.data_len + sizeof(ip_header));
	
}

//uint8_t ip_read(enc28_frame *frame_rec, uint16_t ip_len)
uint8_t ip_read(net_socket * socket, uint16_t ip_len)
{
	uint8_t res = 0;
	char s1[STR_LEN];
	

	ip_pckt ip_msg;
	ip_msg.hdr = (void *)socket->frame_repl.data;
	ip_msg.data = socket->frame_repl.data + sizeof(ip_header);

	if((ip_len > sizeof(ip_header)) && (ip_msg.hdr->ver_hlen == IP_VERLEN) && (!memcmp(ip_msg.hdr->ip_dest, IP_ADDR_SRC, sizeof(IP_ADDR_SRC))))
	{
		ip_msg.data_len = be16toword(ip_msg.hdr->pack_len) - sizeof(ip_header);
		
		sprintf(s1,"ip request\r\n");
		uart_transmit((uint8_t *)s1, strlen(s1));
		
		sprintf(s1, "ip addr: %d:%d:%d:%d->%d:%d:%d:%d\r\n", ip_msg.hdr->ip_src[0],
		ip_msg.hdr->ip_src[1], ip_msg.hdr->ip_src[2], ip_msg.hdr->ip_src[3],
		ip_msg.hdr->ip_dest[0], ip_msg.hdr->ip_dest[1], ip_msg.hdr->ip_dest[2], ip_msg.hdr->ip_dest[3]);
		uart_transmit((uint8_t *)s1, strlen(s1));
		
		sprintf(s1, "ip ch_sum %04X\r\n", ip_msg.hdr->ch_sum);
		uart_transmit((uint8_t *)s1, strlen(s1));
		
		ip_msg.hdr->ch_sum = 0;
		ip_msg.hdr->ch_sum = ip_ch_sum_calc((uint8_t *)socket->frame_rec.data, sizeof(ip_header), 0);
		sprintf(s1, "ip ch_sum calc: %04X\r\n", ip_msg.hdr->ch_sum);
		uart_transmit((uint8_t *)s1, strlen(s1));
		
		if(ip_msg.hdr->prot_id == IP_TCP)
		{
			tcp_read(socket, ip_msg.data_len);
		}
		else if (ip_msg.hdr->prot_id == IP_UDP)
		{
			if(udp_read(socket, ip_msg.data_len))
				udp_reply(socket);
			
