AlexeyStarovoitov/STM32F103C8T6/STM32F103 ENC28J60 MQTT TCP/User/Sources/net.c
			tcp_reply(frame_rec, TCP_OP_ACK_OF_DATA, tcp_pckt_len);
			
		}
		else
			tcp_reply(frame_rec, TCP_OP_ACK_OF_FIN, tcp_pckt_len);
	}
	
	else if(tcp_msg.hdr->flgs == TCP_SYN)
	{
		tcp_reply(frame_rec, TCP_OP_SYNACK, tcp_pckt_len);
	}
	else if (tcp_msg.hdr->flgs == TCP_ACK)
	{
		sprintf(s1,"ACK received\r\n");
		uart_transmit((uint8_t *)s1, strlen(s1));

			
	}
	else if (tcp_msg.hdr->flgs == (TCP_FIN | TCP_ACK))
	{
		tcp_reply(frame_rec, TCP_OP_ACK_OF_FIN, tcp_pckt_len);
	}
	res = 1;
	
	return res;
	
}

void tcp_reply(enc28_frame *frame_rec, uint8_t op_type, uint16_t tcp_pckt_len)
{
	static uint8_t tcp_data_rec = 0;
	uint32_t num_seg;
	uint16_t port, tcp_data_rec_len;
	char s1[STR_LEN];
	enc28_frame frame_repl;
	ip_pckt ip_msg;
	tcp_pckt tcp_repl;
	
	ip_msg.hdr = (void *)frame_rec->data;
	ip_msg.data = frame_rec->data + sizeof(ip_header);
	
	tcp_repl.hdr = (void *)ip_msg.data;
	
	memcpy((void *)&frame_repl.hdr, (void *)&(frame_rec->hdr), sizeof(enc28_frame_header)); 
	
	tcp_repl.data_len = 0;
	tcp_repl.data = NULL;
	
	if(op_type == TCP_OP_SYNACK)
		tcp_repl.data_len = 4;
	
	frame_repl.data = (uint8_t*) malloc((sizeof(ip_header) + sizeof(tcp_header) + tcp_repl.data_len) * sizeof(uint8_t));
	memcpy(frame_repl.data, (void*)ip_msg.hdr, sizeof(ip_header));
	memcpy(frame_repl.data + sizeof(ip_header), (void*)tcp_repl.hdr, sizeof(tcp_header));
	tcp_repl.hdr = (void*)(frame_repl.data + sizeof(ip_header));
	
	if(op_type == TCP_OP_SYNACK)
	{
		
		port = tcp_repl.hdr->src_prt;
		tcp_repl.hdr->src_prt = tcp_repl.hdr->dst_prt;
		tcp_repl.hdr->dst_prt = port;
		tcp_repl.hdr->ack_sn = be32todword(be32todword(tcp_repl.hdr->sn)+1);
		tcp_repl.hdr->sn = 1;
		tcp_repl.hdr->flgs = TCP_SYN | TCP_ACK;
		tcp_repl.hdr->hdr_len = (uint8_t)((sizeof(tcp_header) + tcp_repl.data_len) << 2);
		tcp_repl.hdr->win_size = be16toword(TCP_WIN_LEN);
		tcp_repl.hdr->urg_ptr = 0;
		
		tcp_repl.data = frame_repl.data + sizeof(ip_header) + sizeof(tcp_header);
		tcp_repl.data[0] = 2;
		tcp_repl.data[1] = 4;
		tcp_repl.data[2] = (uint8_t)(TCP_SEG_LEN >> 8);
		tcp_repl.data[3] = (uint8_t)TCP_SEG_LEN;
		
		tcp_repl.hdr->ch_sum = 0;
		tcp_repl.hdr->ch_sum = ip_ch_sum_calc(frame_repl.data + sizeof(ip_header) - 8, tcp_repl.data_len + sizeof(tcp_header) + 8, TCP_CH_SUM);
	
		ip_reply(&frame_repl, tcp_repl.data_len + sizeof(tcp_header));
		sprintf(s1,"SYN ACK transmitted\r\n");
		uart_transmit((uint8_t *)s1, strlen(s1));
		
	}
	else if(op_type == TCP_OP_ACK_OF_FIN)
	{
		
		port = tcp_repl.hdr->src_prt;
		tcp_repl.hdr->src_prt = tcp_repl.hdr->dst_prt;
		tcp_repl.hdr->dst_prt = port;
		num_seg = be32todword(tcp_repl.hdr->ack_sn); 
		tcp_repl.hdr->ack_sn = be32todword(be32todword(tcp_repl.hdr->sn)+1);
		tcp_repl.hdr->sn = be32todword(num_seg);
		tcp_repl.hdr->flgs = TCP_ACK;
		tcp_repl.hdr->hdr_len = (uint8_t)((sizeof(tcp_header) + tcp_repl.data_len) << 2);
		tcp_repl.hdr->win_size = be16toword(TCP_WIN_LEN);
		tcp_repl.hdr->urg_ptr = 0;
		tcp_repl.hdr->ch_sum = 0;
		tcp_repl.hdr->ch_sum = ip_ch_sum_calc(frame_repl.data + sizeof(ip_header) - 8, tcp_repl.data_len + sizeof(tcp_header) + 8, TCP_CH_SUM);
		
		ip_reply(&frame_repl, tcp_repl.data_len + sizeof(tcp_header));
		sprintf(s1,"ACK transmitted\r\n");
		uart_transmit((uint8_t *)s1, strlen(s1));
		
		memcpy((void *)&frame_repl.hdr, (void *)&(frame_rec->hdr), sizeof(enc28_frame_header)); 
		memcpy(frame_repl.data, (void*)ip_msg.hdr, sizeof(ip_header));
		tcp_repl.hdr->flgs = TCP_FIN | TCP_ACK;
		tcp_repl.hdr->ch_sum = 0;
		tcp_repl.hdr->ch_sum = ip_ch_sum_calc(frame_repl.data + sizeof(ip_header) - 8, tcp_repl.data_len + sizeof(tcp_header) + 8, TCP_CH_SUM);
		ip_reply(&frame_repl, tcp_repl.data_len + sizeof(tcp_header));
		
		sprintf(s1,"FIN ACK transmitted\r\n");
		uart_transmit((uint8_t *)s1, strlen(s1));
	}
	else if(op_type == TCP_OP_ACK_OF_DATA)
	{
		tcp_data_rec++;
		tcp_data_rec_len = tcp_pckt_len - sizeof(tcp_header);
		port = tcp_repl.hdr->src_prt;
		tcp_repl.hdr->src_prt = tcp_repl.hdr->dst_prt;
		tcp_repl.hdr->dst_prt = port;
		num_seg = be32todword(tcp_repl.hdr->ack_sn); 
		tcp_repl.hdr->ack_sn = be32todword(be32todword(tcp_repl.hdr->sn)+tcp_data_rec_len);
		tcp_repl.hdr->sn = be32todword(num_seg);
		tcp_repl.hdr->flgs = TCP_ACK;
		tcp_repl.hdr->hdr_len = (uint8_t)((sizeof(tcp_header)) << 2);
		tcp_repl.hdr->win_size = be16toword(TCP_WIN_LEN);
		tcp_repl.hdr->urg_ptr = 0;
		tcp_repl.hdr->ch_sum = 0;
		tcp_repl.hdr->ch_sum = ip_ch_sum_calc(frame_repl.data + sizeof(ip_header) - 8, sizeof(tcp_header) + 8, TCP_CH_SUM);
	
		ip_reply(&frame_repl, sizeof(tcp_header));
		sprintf(s1,"DATA ACK transmitted\r\n");
		uart_transmit((uint8_t *)s1, strlen(s1));
		if(tcp_data_rec == 2)
		{
			tcp_data_rec = 0;
			free(frame_repl.data);
			
			sprintf(s1,"Hello from TCP Server to TCP Client\r\n");
			tcp_repl.data_len = strlen(s1);
			
			tcp_repl.hdr = (void *)ip_msg.data;
			memcpy((void *)&frame_repl.hdr, (void *)&(frame_rec->hdr), sizeof(enc28_frame_header)); 
			
			frame_repl.data = (uint8_t*) malloc((sizeof(ip_header) + sizeof(tcp_header) + tcp_repl.data_len) * sizeof(uint8_t));
			memcpy(frame_repl.data, (void*)ip_msg.hdr, sizeof(ip_header));
			memcpy(frame_repl.data + sizeof(ip_header), (void*)tcp_repl.hdr, sizeof(tcp_header));
			memcpy(frame_repl.data + sizeof(ip_header) + sizeof(tcp_header), (void*)s1, tcp_repl.data_len);
			tcp_repl.hdr = (void*)(frame_repl.data + sizeof(ip_header));
			tcp_repl.data = frame_repl.data + sizeof(ip_header) +  sizeof(tcp_header);
			
			port = tcp_repl.hdr->src_prt;
			tcp_repl.hdr->src_prt = tcp_repl.hdr->dst_prt;
			tcp_repl.hdr->dst_prt = port;
			num_seg = be32todword(tcp_repl.hdr->ack_sn); 
			tcp_repl.hdr->ack_sn = be32todword(be32todword(tcp_repl.hdr->sn)+tcp_data_rec_len);
			tcp_repl.hdr->sn = be32todword(num_seg);
			tcp_repl.hdr->flgs = TCP_PSH | TCP_ACK;
			tcp_repl.hdr->hdr_len = (uint8_t)((sizeof(tcp_header)) << 2);
			tcp_repl.hdr->win_size = be16toword(TCP_WIN_LEN);
			tcp_repl.hdr->urg_ptr = 0;
			tcp_repl.hdr->ch_sum = 0;
			tcp_repl.data_len = strlen(s1);
			
			tcp_repl.hdr->ch_sum = ip_ch_sum_calc(frame_repl.data + sizeof(ip_header) - 8, sizeof(tcp_header) + tcp_repl.data_len + 8, TCP_CH_SUM);
			ip_reply(&frame_repl, tcp_repl.data_len + sizeof(tcp_header));
			sprintf(s1,"DATA transmitted\r\n");
			uart_transmit((uint8_t *)s1, strlen(s1));
		}
	}
	
	free(frame_repl.data);
	
}
